; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v4 ?v1)
             (pred_3 ?v5 ?v11)
             (pred_10 ?v4 ?v11)
             (pred_12 ?v9 ?v4 )
	     (pred_5 ?v4)
             (pred_1 ?v7)
             (pred_7 ?v5)
             (pred_4 ?v11)
             (pred_2 ?v4)
             (pred_11 ?v5)
             (pred_6 ?v4)
             (pred_8 ))



(:action op_5
:parameters (?v3 ?v10 ?v12 ?v8)
:precondition (and (pred_1 ?v3) (pred_1 ?v10) (pred_7 ?v12) (pred_4 ?v8)
          (pred_9 ?v3 ?v10) (pred_3 ?v12 ?v8)
                   (pred_10 ?v10 ?v8) (pred_5 ?v3) 
                   (pred_2 ?v10) (pred_11 ?v12))
:effect (and  (pred_6 ?v10) (not (pred_2 ?v10))))


(:action op_3
:parameters (?v3 ?v2)
:precondition (and (pred_1 ?v3) (pred_1 ?v2)
               (pred_5 ?v3) (pred_9 ?v3 ?v2) (pred_6 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v3))))

(:action op_4
:parameters (?v3 ?v12)
:precondition (and (pred_1 ?v3) (pred_7 ?v12) 
                  (pred_5 ?v3) (pred_12 ?v12 ?v3) (pred_8 ))
:effect (and (pred_11 ?v12)
   (not (pred_12 ?v12 ?v3)) (not (pred_8 ))))


(:action op_1
:parameters (?v3 ?v6 ?v13)
:precondition (and (pred_1 ?v3) (pred_7 ?v6) (pred_7 ?v13)
                  (pred_5 ?v3) (pred_11 ?v13) (pred_12 ?v6 ?v3))
:effect (and (pred_11 ?v6) (pred_12 ?v13 ?v3)
        (not (pred_11 ?v13)) (not (pred_12 ?v6 ?v3))))

(:action op_2
:parameters (?v3 ?v12)
:precondition (and (pred_1 ?v3) (pred_7 ?v12) 
                  (pred_5 ?v3) (pred_11 ?v12))
:effect (and (pred_8 ) (pred_12 ?v12 ?v3) (not (pred_11 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_10 obj_09 obj_04 obj_17 obj_07 obj_06 obj_16 obj_20 obj_14 obj_13 obj_18 obj_21 obj_02 obj_15 obj_08
    obj_19 obj_01
    obj_03 obj_11 obj_12
    )

    (:init
       (pred_8)

       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_04)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_1 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_21)
       (pred_1 obj_02)
       (pred_1 obj_15)
       (pred_1 obj_08)
       (pred_4 obj_19)
       (pred_4 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_11)
       (pred_7 obj_12)

       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_13 obj_15)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_21 obj_02)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_14)
       (pred_9 obj_02 obj_21)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_18)
       (pred_10  obj_04 obj_19)
       (pred_10  obj_14 obj_01)
       (pred_10  obj_18 obj_01)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_02)
       (pred_6 obj_15)
       (pred_6 obj_08)

       (pred_3  obj_03 obj_19)
       (pred_3  obj_11 obj_01)
       (pred_3  obj_12 obj_01)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_12 obj_17)
       (pred_5 obj_02)
    )

    (:goal (and
       (pred_12 obj_12 obj_14)
    ))
(:constraints
  (always (not (pred_5 obj_07)))
)
)

; plan
1. (op_3 obj_02 obj_21)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_21)
   goals met: 0 of 1
2. (op_3 obj_21 obj_20)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_20)
   goals met: 0 of 1
3. (op_3 obj_20 obj_17)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_17)
   goals met: 0 of 1
4. (op_4 obj_17 obj_12)
   deleted: (pred_12 obj_12 obj_17) (pred_8)
   added: (pred_11 obj_12)
   goals met: 0 of 1
5. (op_3 obj_17 obj_20)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_20)
   goals met: 0 of 1
6. (op_5 obj_20 obj_14 obj_12 obj_01)
   deleted: (pred_2 obj_14)
   added: (pred_6 obj_14)
   goals met: 0 of 1
7. (op_3 obj_20 obj_14)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_14)
   goals met: 0 of 1
8. (op_2 obj_14 obj_12)
   deleted: (pred_11 obj_12)
   added: (pred_8) (pred_12 obj_12 obj_14)
   goals met: 1 of 1
